In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("estudiantes.csv")

In [5]:
df.head()

   nombre  edad     carrera  calificacion       ciudad
0     Ana    20  Ingenieria            85         CDMX
1    Luis    22    Medicina            90  Guadalajara
2   María    21     Derecho            78         CDMX
3  Carlos    23  Ingenieria            92    Monterrey
4   Sofía    20    Medicina            88         CDMX

In [6]:
df.head(3)

  nombre  edad     carrera  calificacion       ciudad
0    Ana    20  Ingenieria            85         CDMX
1   Luis    22    Medicina            90  Guadalajara
2  María    21     Derecho            78         CDMX

In [8]:
df.dtypes

nombre          object
edad             int64
carrera         object
calificacion     int64
ciudad          object
dtype: object

In [9]:
tipos_datos = df.dtypes

In [10]:
tipos_datos

nombre          object
edad             int64
carrera         object
calificacion     int64
ciudad          object
dtype: object

In [12]:
df.select_dtypes(include="number")

   edad  calificacion
0    20            85
1    22            90
2    21            78
3    23            92
4    20            88
5    22            75

In [13]:
df.select_dtypes(include="object")

   nombre     carrera       ciudad
0     Ana  Ingenieria         CDMX
1    Luis    Medicina  Guadalajara
2   María     Derecho         CDMX
3  Carlos  Ingenieria    Monterrey
4   Sofía    Medicina         CDMX
5    Juan     Derecho       Puebla

In [14]:
lista_nombres = df["nombre"].tolist()

In [15]:
lista_nombres

['Ana', 'Luis', 'María', 'Carlos', 'Sofía', 'Juan']

In [16]:
lista_ciudades = df["ciudad"].tolist()

In [17]:
lista_ciudades

['CDMX', 'Guadalajara', 'CDMX', 'Monterrey', 'CDMX', 'Puebla']

In [22]:
lista_calificaciones = df["calificacion"].tolist()

In [23]:
lista_calificaciones

[85, 90, 78, 92, 88, 75]

In [24]:
lista_calificaciones[0] , lista_calificaciones[-1]

(85, 75)

In [25]:
diccionario_aprobatorio = {
    "promedio_aprobatorio":70
}

In [26]:
diccionario_aprobatorio

{'promedio_aprobatorio': 70}

In [27]:
diccionario_total = {
    "total_estudiantes":len(df)
}

In [28]:
diccionario_total

{'total_estudiantes': 6}

In [29]:
diccionario_carreras = {
    "carreras": df["carrera"].tolist()
}

In [31]:
diccionario_carreras

{'carreras': ['Ingenieria',
  'Medicina',
  'Derecho',
  'Ingenieria',
  'Medicina',
  'Derecho']}

In [32]:
df["carrera"].value_counts()

carrera
Ingenieria    2
Medicina      2
Derecho       2
Name: count, dtype: int64

In [34]:
df["ciudad"].value_counts()

ciudad
CDMX           3
Guadalajara    1
Monterrey      1
Puebla         1
Name: count, dtype: int64

In [35]:
df["carrera"].value_counts(normalize=True)

carrera
Ingenieria    0.333333
Medicina      0.333333
Derecho       0.333333
Name: proportion, dtype: float64

In [36]:
df["carrera"].value_counts(normalize=True)

carrera
Ingenieria    0.333333
Medicina      0.333333
Derecho       0.333333
Name: proportion, dtype: float64

In [37]:
df["carrera"].value_counts(normalize=True).sort_values(ascending=False)

carrera
Ingenieria    0.333333
Medicina      0.333333
Derecho       0.333333
Name: proportion, dtype: float64

In [38]:
df["calificacion"].min()

np.int64(75)

In [39]:
df["carrera"].nunique(), df["ciudad"].nunique()

(3, 4)